tap 'caskroom/fonts'
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap 'homebrew/services'
tap 'jhawthorn/fzy'
tap 'mscharley/homebrew'
tap 'neovim/neovim'

brew 'git'
brew 'docker'
brew 'git-secrets'
brew 'hub'
brew 'zsh'
brew 'vim'
brew 'neovim'
brew 'pgcli'
brew 'litecli'
brew 'wget'
brew 'postgresql'
brew 'sqlite'
brew 'putty'
brew 'rbenv'
brew 'pyenv'
brew 'circleci'
brew 'imagemagick'
brew 'ffmpeg'
brew 'tmux'
brew 'go'
brew 'node'

# casks
cask 'brooklyn'
cask 'clipy'
cask 'font-ricty-diminished'
cask 'kitty'
cask 'opera'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'chatwork'
cask 'slack'
cask 'font-awesome-terminal-fonts'
cask 'kindle'
cask 'ngrok'
cask 'vagrant'

cask 'dolphin' # game cube emu
cask 'visualboyadvance-m' # game boy advance emu
cask 'desmume' # DS, 3DS emu
